# А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка; 
# Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; 
# Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков
# A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка; B, C, M, P – 3 очка; 
# F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков
dict_rus = {
    'д':2,'с':1,'р':1,'и':1,'е':1,'в':1,'а':1,'н':1 ,'о':1, 'у':2, 
    'т':1, 'б':3, 'к':2, 'л':2, 'м':2, 'п':2, 'н':1,'г':3, 'ё':3, 'ь':3,
    'я':3, 'й':4, 'ы':1, 'ж':5, 'з':5, 'х':5, 'ц':5, 'ч':5, 'ш':10, 'ф':10, 'ъ':10
    }
dict_eng = {
    'a':1, 'e':1, 'i':1, 'l':1, 's':1, 'r':1, 'n':1, 'o':1, 'u':1, 't':1, 
    'e':1, 'd':2, 'g':2, 'c':3, 'm':3, 'p':3, 'b':3, 'f':4, 'h':4, 'k':5,
    'v':4, 'w':4, 'y':4, 'j':8, 'x':8, 'q':10, 'z':10
    }

dict_all = dict_rus | dict_eng
s = list(input('введите слово: '))
slovo=0
for i in s:
    slovo += dict_all[i] 
print(slovo)
